RIOT-OS/RIOT/cpu/esp32/periph/i2c_hw.c
/*
 * Copyright (C) 2018 Gunar Schorcht
 *
 * This file is subject to the terms and conditions of the GNU Lesser
 * General Public License v2.1. See the file LICENSE in the top level
 * directory for more details.
 */

/**
 * @ingroup cpu_esp32
 * @ingroup drivers_periph_i2c
 * @{
 *
 * @file
 * @brief       Low-level I2C driver implementation for ESP32 SDK
 *
 * @note        The hardware implementation seems to be very poor and faulty.
 *              I2C commands in the I2C command pipeline are not executed
 *              sporadically. A number of ACK errors and timeouts caused by
 *              protocol errors are the result. You should use the hardware
 *              implementation only if they can be tolerated.
 *
 * @author      Gunar Schorcht <gunar@schorcht.net>
 *
 * @}
 */

#if defined(MODULE_ESP_I2C_HW) /* hardware implementation used */

/**
 * PLEASE NOTE:
 *
 * Some parts of the implementation were inspired by the Espressif IoT
 * Development Framework [ESP-IDF](https://github.com/espressif/esp-idf.git)
 * implementation of I2C. These partes are marked with an according copyright
 * notice.
*/

#define ENABLE_DEBUG (0)
#include "debug.h"

#include <errno.h>
#include <stdbool.h>
#include <string.h>

#include "cpu.h"
#include "log.h"
#include "mutex.h"
#include "periph_conf.h"
#include "periph/gpio.h"
#include "periph/i2c.h"
#include "thread_flags.h"

#include "esp_common.h"
#include "gpio_arch.h"
#include "driver/periph_ctrl.h"
#include "irq_arch.h"
#include "rom/ets_sys.h"
#include "soc/gpio_reg.h"
#include "soc/gpio_sig_map.h"
#include "soc/gpio_struct.h"
#include "soc/i2c_reg.h"
#include "soc/i2c_struct.h"
#include "soc/rtc.h"
#include "soc/soc.h"
#include "syscalls.h"
#include "xtensa/xtensa_api.h"

#if defined(I2C0_SPEED) || defined(I2C1_SPEED)

#undef  I2C_CLK_FREQ
#define I2C_CLK_FREQ   rtc_clk_apb_freq_get() /* APB_CLK is used */

/* operation codes used for commands */
#define I2C_CMD_RSTART 0
#define I2C_CMD_WRITE  1
#define I2C_CMD_READ   2
#define I2C_CMD_STOP   3
#define I2C_CMD_END    4

/* maximum number of data that can be written / read in one transfer */
#define I2C_MAX_DATA   30

#define I2C_FIFO_USED  1

struct i2c_hw_t {
    i2c_dev_t* regs;        /* pointer to register data struct of the I2C device */
    uint8_t mod;            /* peripheral hardware module of the I2C interface */
    uint8_t int_src;        /* peripheral interrupt source used by the I2C device */
    uint8_t pin_scl;        /* SCL pin */
    uint8_t pin_sda;        /* SDA pin */
    uint8_t signal_scl_in;  /* SCL signal to the controller */
    uint8_t signal_scl_out; /* SCL signal from the controller */
    uint8_t signal_sda_in;  /* SDA signal to the controller */
    uint8_t signal_sda_out; /* SDA signal from the controller */
};

static const struct i2c_hw_t _i2c_hw[] = {
    #if defined(I2C0_SCL) && defined(I2C0_SDA) && defined(I2C0_SPEED)
    {
        .regs = &I2C0,
        .mod = PERIPH_I2C0_MODULE,
        .int_src = ETS_I2C_EXT0_INTR_SOURCE,
        .pin_scl = I2C0_SCL,
        .pin_sda = I2C0_SDA,
        .signal_scl_in = I2CEXT0_SCL_IN_IDX,
        .signal_scl_out = I2CEXT0_SCL_OUT_IDX,
        .signal_sda_in = I2CEXT0_SDA_IN_IDX,
        .signal_sda_out = I2CEXT0_SDA_OUT_IDX,
    },
    #endif
    #if defined(I2C1_SCL) && defined(I2C1_SDA) && defined(I2C1_SPEED)
    {
        .regs = &I2C1,
        .mod = PERIPH_I2C1_MODULE,
        .int_src = ETS_I2C_EXT1_INTR_SOURCE,
        .pin_scl = I2C1_SCL,
        .pin_sda = I2C1_SDA,
        .signal_scl_in = I2CEXT1_SCL_IN_IDX,
        .signal_scl_out = I2CEXT1_SCL_OUT_IDX,
        .signal_sda_in = I2CEXT1_SDA_IN_IDX,
        .signal_sda_out = I2CEXT1_SDA_OUT_IDX,
    }
    #endif
};

struct _i2c_bus_t
{
    i2c_speed_t speed; /* bus speed */
    uint8_t cmd;       /* command index */
    uint8_t data;      /* index in RAM for data */
    mutex_t lock;      /* mutex lock */
    kernel_pid_t pid;  /* PID of thread that triggered a transfer */
    uint32_t results;  /* results of a transfer */
};

static struct _i2c_bus_t _i2c_bus[] =
{
    #if defined(I2C0_SCL) && defined(I2C0_SDA) && defined(I2C0_SPEED)
    {
        .speed = I2C0_SPEED,
        .cmd = 0,
        .data = 0,
        .lock = MUTEX_INIT
    },
    #endif
    #if defined(I2C1_SCL) && defined(I2C1_SDA) && defined(I2C1_SPEED)
    {
        .speed = I2C1_SPEED,
        .cmd = 0,
        .data = 0,
        .lock = MUTEX_INIT
    },
    #endif
};

/* the number of I2C bus devices used */
const unsigned i2c_bus_num = sizeof(_i2c_bus) / sizeof(_i2c_bus[0]);

/* forward declaration of internal functions */

static int  _i2c_init_pins (i2c_t dev);
static void _i2c_start_cmd (i2c_t dev);
static void _i2c_stop_cmd  (i2c_t dev);
static void _i2c_end_cmd   (i2c_t dev);
static void _i2c_write_cmd (i2c_t dev, const uint8_t* data, uint8_t len);
static void _i2c_read_cmd  (i2c_t dev, uint8_t* data, uint8_t len, bool last);
static void _i2c_transfer  (i2c_t dev);
static void _i2c_reset_hw  (i2c_t dev);
static void _i2c_clear_bus (i2c_t dev);
static void _i2c_intr_handler (void *arg);
static inline void _i2c_delay (uint32_t delay);

/* implementation of i2c interface */

void i2c_init(i2c_t dev)
{
    CHECK_PARAM (dev < i2c_bus_num)

    if (_i2c_bus[dev].speed == I2C_SPEED_FAST_PLUS ||
        _i2c_bus[dev].speed == I2C_SPEED_HIGH) {
        LOG_TAG_INFO("i2c", "I2C_SPEED_FAST_PLUS and I2C_SPEED_HIGH "
                     "are not supported\n");
        return;
    }

    i2c_acquire (dev);

    _i2c_bus[dev].cmd = 0;
    _i2c_bus[dev].data = 0;

    DEBUG ("%s scl=%d sda=%d speed=%d\n", __func__,
           _i2c_hw[dev].pin_scl, _i2c_hw[dev].pin_sda, _i2c_bus[dev].speed);

    /* enable (power on) the according I2C module */
    periph_module_enable(_i2c_hw[dev].mod);

    /* initialize pins */
    if (_i2c_init_pins(dev) != 0) {
        return;
    }

    /* set master mode */
    _i2c_hw[dev].regs->ctr.ms_mode = 1;

    /* set bit order to MSB first */
    _i2c_hw[dev].regs->ctr.tx_lsb_first = 0;
    _i2c_hw[dev].regs->ctr.rx_lsb_first = 0;

