RIOT-OS/RIOT/cpu/esp32/periph/i2c_hw.c
    /* determine the half period of clock in APB clock cycles */
    uint32_t half_period = 0;

    switch (_i2c_bus[dev].speed) {
        case I2C_SPEED_LOW:
            /* 10 kbps (period 100 us) */
            half_period = (I2C_CLK_FREQ / 10000) >> 1;
            break;

        case I2C_SPEED_NORMAL:
            /* 100 kbps (period 10 us) */
            half_period = (I2C_CLK_FREQ / 100000) >> 1;
            half_period = half_period * 95 / 100; /* correction factor */
            break;

        case I2C_SPEED_FAST:
            /* 400 kbps (period 2.5 us) */
            half_period = (I2C_CLK_FREQ / 400000) >> 1;
            half_period = half_period * 82 / 100; /* correction factor */
            break;

        case I2C_SPEED_FAST_PLUS:
            /* 1 Mbps (period 1 us) not working */
            half_period = (I2C_CLK_FREQ / 1000000) >> 1;
            break;

        case I2C_SPEED_HIGH:
            /* 3.4 Mbps (period 0.3 us) not working */
            half_period = (I2C_CLK_FREQ / 3400000) >> 1;
            break;

        default:
            LOG_TAG_ERROR("i2c", "Invalid speed value in %s\n", __func__);
            return;
    }

    /* set an timeout which is at least 16 times of half cycle */
    _i2c_hw[dev].regs->timeout.tout = half_period << 4;

    /* timing for SCL (low and high time in APB clock cycles) */
    _i2c_hw[dev].regs->scl_low_period.period = half_period;
    _i2c_hw[dev].regs->scl_high_period.period = half_period;

    /* timing for SDA (sample time after rising edge and hold time after falling edge) */
    _i2c_hw[dev].regs->sda_sample.time = half_period >> 1;
    _i2c_hw[dev].regs->sda_hold.time = half_period >> 1;

    /* timing for START condition (START hold and repeated START setup time) */
    _i2c_hw[dev].regs->scl_start_hold.time = half_period >> 1;
    _i2c_hw[dev].regs->scl_rstart_setup.time = half_period >> 1;

    /* timing for STOP condition (STOP hold and STOP setup time) */
    _i2c_hw[dev].regs->scl_stop_hold.time = half_period >> 1;
    _i2c_hw[dev].regs->scl_stop_setup.time = half_period >> 1;

    /* configure open drain outputs */
    _i2c_hw[dev].regs->ctr.scl_force_out = 1;
    _i2c_hw[dev].regs->ctr.sda_force_out = 1;

    /* sample data during high level */
    _i2c_hw[dev].regs->ctr.sample_scl_level = 0;

    /* enable non FIFO access and disable slave FIFO address offset */
    #if I2C_FIFO_USED
    _i2c_hw[dev].regs->fifo_conf.nonfifo_en = 0;
    #else
    _i2c_hw[dev].regs->fifo_conf.nonfifo_en = 1;
    _i2c_hw[dev].regs->fifo_conf.nonfifo_rx_thres = 0;
    _i2c_hw[dev].regs->fifo_conf.nonfifo_tx_thres = 0;
    _i2c_hw[dev].regs->fifo_conf.rx_fifo_full_thrhd = 0;
    _i2c_hw[dev].regs->fifo_conf.tx_fifo_empty_thrhd = 0;

    #endif
    _i2c_hw[dev].regs->fifo_conf.fifo_addr_cfg_en = 0;

    /* route all I2C interrupt sources to same the CPU interrupt */
    intr_matrix_set(PRO_CPU_NUM, _i2c_hw[dev].int_src, CPU_INUM_I2C);

    /* set the interrupt handler and enable the interrupt */
    xt_set_interrupt_handler(CPU_INUM_I2C, _i2c_intr_handler, NULL);
    xt_ints_on(BIT(CPU_INUM_I2C));

    i2c_release (dev);

    return;
}

int i2c_acquire(i2c_t dev)
{
    DEBUG ("%s\n", __func__);

    CHECK_PARAM_RET (dev < i2c_bus_num, -1)

    mutex_lock(&_i2c_bus[dev].lock);
    _i2c_reset_hw(dev);
    return 0;
}

int i2c_release(i2c_t dev)
{
    DEBUG ("%s\n", __func__);

    CHECK_PARAM_RET (dev < i2c_bus_num, -1)

    _i2c_reset_hw (dev);
    mutex_unlock(&_i2c_bus[dev].lock);
    return 0;
}

#define _i2c_return_on_error(dev) \
    if (_i2c_bus[dev].results & I2C_ARBITRATION_LOST_INT_ENA) { \
        LOG_TAG_ERROR("i2c", "arbitration lost dev=%u\n", dev); \
        _i2c_reset_hw (dev); \
__asm__ volatile ("isync"); \
        return -EAGAIN; \
    } \
    else if (_i2c_bus[dev].results & I2C_ACK_ERR_INT_ENA) { \
        LOG_TAG_ERROR("i2c", "ack error dev=%u\n", dev); \
        _i2c_reset_hw (dev); \
__asm__ volatile ("isync"); \
        return -EIO; \
    } \
    else if (_i2c_bus[dev].results & I2C_TIME_OUT_INT_ENA) { \
        LOG_TAG_ERROR("i2c", "bus timeout dev=%u\n", dev); \
        _i2c_reset_hw (dev); \
__asm__ volatile ("isync"); \
        return -ETIMEDOUT; \
    }

int i2c_read_bytes(i2c_t dev, uint16_t addr, void *data, size_t len, uint8_t flags)
{
    DEBUG ("%s dev=%u addr=%02x data=%p len=%d flags=%01x\n",
           __func__, dev, addr, data, len, flags);

    CHECK_PARAM_RET (dev < i2c_bus_num, -EINVAL);
    CHECK_PARAM_RET (len > 0, -EINVAL);
    CHECK_PARAM_RET (data != NULL, -EINVAL);

    /*  if I2C_NOSTART is not set, START condition and ADDR is used */
    if (!(flags & I2C_NOSTART)) {

        /* send START condition */
        _i2c_start_cmd (dev);

        /* address handling */
        if (flags & I2C_ADDR10) {
            /* prepare 10 bit address bytes */
            uint8_t addr10[2];
            addr10[0] = 0xf0 | (addr & 0x0300) >> 7 | I2C_READ;
            addr10[1] = addr & 0xff;
            /* send ADDR with read flag */
            _i2c_write_cmd (dev, addr10, 2);
        }
        else {
            /* send ADDR with read flag */
            uint8_t addr7 = (addr << 1 | I2C_READ);
            _i2c_write_cmd (dev, &addr7, 1);
        }
    }

    /* read data bytes in blocks of I2C_MAX_DATA bytes */

    uint32_t off = 0;

    /* if len > I2C_MAX_DATA read blocks I2C_MAX_DATA bytes at a time */
    while (len > I2C_MAX_DATA) {

        /* read one block of data bytes command */
        _i2c_read_cmd (dev, data, I2C_MAX_DATA, false);
        _i2c_end_cmd (dev);
        _i2c_transfer (dev);
        _i2c_return_on_error (dev);

        /* if transfer was successful, fetch the data from I2C RAM */
        for (unsigned i = 0; i < I2C_MAX_DATA; i++) {
            #if I2C_FIFO_USED
            ((uint8_t*)data)[i + off] = _i2c_hw[dev].regs->fifo_data.data;
            #else
            ((uint8_t*)data)[i + off] = _i2c_hw[dev].regs->ram_data[i];
            #endif
        }

        len -= I2C_MAX_DATA;
        off += I2C_MAX_DATA;
    }

    /* read remaining data bytes command with a final NAK */
    _i2c_read_cmd (dev, data, len, true);

