RIOT-OS/RIOT/cpu/esp32/periph/i2c_hw.c
    /* if I2C_NOSTOP flag is not set, send STOP condition is used */
    if (!(flags & I2C_NOSTOP)) {
        /* send STOP condition */
        _i2c_stop_cmd (dev);
    }
    else {
        /* otherwise place end command in pipeline */
        _i2c_end_cmd (dev);
    }

    /* finish operation by executing the command pipeline */
    _i2c_transfer (dev);
    _i2c_return_on_error (dev);

    /* if transfer was successful, fetch data from I2C RAM */
    for (unsigned i = 0; i < len; i++) {
        #if I2C_FIFO_USED
        ((uint8_t*)data)[i + off] = _i2c_hw[dev].regs->fifo_data.data;
        #else
        ((uint8_t*)data)[i + off] = _i2c_hw[dev].regs->ram_data[i];
        #endif
    }

    /* return 0 on success */
    return 0;
}

int i2c_write_bytes(i2c_t dev, uint16_t addr, const void *data, size_t len, uint8_t flags)
{
    DEBUG ("%s dev=%u addr=%02x data=%p len=%d flags=%01x\n",
           __func__, dev, addr, data, len, flags);

    CHECK_PARAM_RET (dev < i2c_bus_num, -EINVAL);
    CHECK_PARAM_RET (len > 0, -EINVAL);
    CHECK_PARAM_RET (data != NULL, -EINVAL);

    /*  if I2C_NOSTART is not set, START condition and ADDR is used */
    if (!(flags & I2C_NOSTART)) {

        /* send START condition */
        _i2c_start_cmd (dev);

        /* address handling */
        if (flags & I2C_ADDR10) {
            /* prepare 10 bit address bytes */
            uint8_t addr10[2];
            addr10[0] = 0xf0 | (addr & 0x0300) >> 7;
            addr10[1] = addr & 0xff;
            /* send ADDR without read flag */
            _i2c_write_cmd (dev, addr10, 2);
        }
        else {
            /* send ADDR without read flag */
            uint8_t addr7 = addr << 1;
            _i2c_write_cmd (dev, &addr7, 1);
        }
    }

    /* send data bytes in blocks of I2C_MAX_DATA bytes */

    uint32_t off = 0;

    /* if len > I2C_MAX_DATA write blocks I2C_MAX_DATA bytes at a time */
    while (len > I2C_MAX_DATA) {

        /* send on block of data bytes */
        _i2c_write_cmd (dev, ((uint8_t*)data) + off, I2C_MAX_DATA);
        _i2c_end_cmd (dev);
        _i2c_transfer (dev);
        _i2c_return_on_error (dev);

        len -= I2C_MAX_DATA;
        off += I2C_MAX_DATA;
    }

    /* write remaining data bytes command */
    _i2c_write_cmd (dev, ((uint8_t*)data), len);

    /* if I2C_NOSTOP flag is not set, send STOP condition is used */
    if (!(flags & I2C_NOSTOP)) {
        /* send STOP condition */
        _i2c_stop_cmd (dev);
    }
    else {
        /* otherwise place end command in pipeline */
        _i2c_end_cmd (dev);
    }

    /* finish operation by executing the command pipeline */
    _i2c_transfer (dev);
    _i2c_return_on_error (dev);

    /* return 0 on success */
    return 0;
}

/* internal functions */

static int _i2c_init_pins(i2c_t dev)
{
    /*
     * reset GPIO usage type if the pins were used already for I2C before to
     * make it possible to reinitialize I2C
     */
    if (gpio_get_pin_usage(_i2c_hw[dev].pin_scl) == _I2C) {
        gpio_set_pin_usage(_i2c_hw[dev].pin_scl, _GPIO);
    }
    if (gpio_get_pin_usage(_i2c_hw[dev].pin_sda) == _I2C) {
        gpio_set_pin_usage(_i2c_hw[dev].pin_sda, _GPIO);
    }

    /* try to configure SDA and SCL pin as GPIO in open-drain mode with enabled pull-ups */
    if (gpio_init (_i2c_hw[dev].pin_scl, GPIO_IN_OD_PU) ||
        gpio_init (_i2c_hw[dev].pin_sda, GPIO_IN_OD_PU)) {
        return -ENODEV;
    }

    /* bring signals to high */
    gpio_set(_i2c_hw[dev].pin_scl);
    gpio_set(_i2c_hw[dev].pin_sda);

    /* store the usage type in GPIO table */
    gpio_set_pin_usage(_i2c_hw[dev].pin_scl, _I2C);
    gpio_set_pin_usage(_i2c_hw[dev].pin_sda, _I2C);

    /* connect SCL and SDA pins to output signals through the GPIO matrix */
    GPIO.func_out_sel_cfg[_i2c_hw[dev].pin_scl].func_sel = _i2c_hw[dev].signal_scl_out;
    GPIO.func_out_sel_cfg[_i2c_hw[dev].pin_sda].func_sel = _i2c_hw[dev].signal_sda_out;

    /* connect SCL and SDA input signals to pins through the GPIO matrix */
    GPIO.func_in_sel_cfg[_i2c_hw[dev].signal_scl_in].sig_in_sel = 1;
    GPIO.func_in_sel_cfg[_i2c_hw[dev].signal_scl_in].sig_in_inv = 0;
    GPIO.func_in_sel_cfg[_i2c_hw[dev].signal_scl_in].func_sel = _i2c_hw[dev].pin_scl;
    GPIO.func_in_sel_cfg[_i2c_hw[dev].signal_sda_in].sig_in_sel = 1;
    GPIO.func_in_sel_cfg[_i2c_hw[dev].signal_sda_in].sig_in_inv = 0;
    GPIO.func_in_sel_cfg[_i2c_hw[dev].signal_sda_in].func_sel = _i2c_hw[dev].pin_sda;

    return 0;
}

static void _i2c_start_cmd(i2c_t dev)
{
    DEBUG ("%s\n", __func__);

    /* place START condition command in command queue */
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].val = 0;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].op_code = I2C_CMD_RSTART;

    /* increment the command counter */
    _i2c_bus[dev].cmd++;
}

static void _i2c_stop_cmd (i2c_t dev)
{
    DEBUG ("%s\n", __func__);

    /* place STOP condition command in command queue */
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].val = 0;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].op_code = I2C_CMD_STOP;

    /* increment the command counter */
    _i2c_bus[dev].cmd++;
}

static void _i2c_end_cmd (i2c_t dev)
{
    DEBUG ("%s\n", __func__);

    /* place END command for continues data transmission in command queue */
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].val = 0;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].op_code = I2C_CMD_END;

    /* increment the command counter */
    _i2c_bus[dev].cmd++;
}

static void _i2c_write_cmd (i2c_t dev, const uint8_t* data, uint8_t len)
{
    DEBUG ("%s dev=%u data=%p len=%d\n", __func__, dev, data, len);

    if (_i2c_bus[dev].data + len > I2C_MAX_DATA) {
        LOG_TAG_ERROR("i2c", "Maximum number of bytes (32 bytes) that can be "
                      "sent with on transfer reached\n");
        return;
    }

    /* store the byte in RAM of I2C controller and increment the data counter */
    for (int i = 0; i < len; i++) {
        #if I2C_FIFO_USED
        WRITE_PERI_REG(I2C_DATA_APB_REG(dev), data[i]);
        #else
        _i2c_hw[dev].regs->ram_data[_i2c_bus[dev].data++] = (uint32_t)data[i];
        #endif
    }

    /* place WRITE command for multiple bytes in command queue */
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].val = 0;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].byte_num = len;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].ack_en = 1;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].ack_exp = 0;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].ack_val = 0;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].op_code = I2C_CMD_WRITE;

    /* increment the command counter */
    _i2c_bus[dev].cmd++;
}

static void _i2c_read_cmd (i2c_t dev, uint8_t* data, uint8_t len, bool last)
{
    DEBUG ("%s dev=%u data=%p len=%d\n", __func__, dev, data, len);

    if (len < 1 || len > I2C_MAX_DATA) {
        /* at least one byte has to be read */
        LOG_TAG_ERROR("i2c", "At least one byte has to be read\n");
        return;
    }

    if (len > 1)
    {
        /* place READ command for len-1 bytes with positive ack in command queue*/
        _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].val = 0;
        _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].byte_num = len-1;
        _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].ack_en = 0;
        _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].ack_exp = 0;
        _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].ack_val = 0;
        _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].op_code = I2C_CMD_READ;

        /* increment the command counter */
        _i2c_bus[dev].cmd++;
    }

    /* place READ command for last byte with negative ack in last segment in command queue*/
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].val = 0;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].byte_num = 1;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].ack_en = 0;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].ack_exp = 0;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].ack_val = last ? 1 : 0;
    _i2c_hw[dev].regs->command[_i2c_bus[dev].cmd].op_code = I2C_CMD_READ;

    /* increment the command counter */
    _i2c_bus[dev].cmd++;
}

