RIOT-OS/RIOT/cpu/esp32/periph/i2c_hw.c
static inline void _i2c_delay (uint32_t cycles)
{
    /* produces a delay of 0,0625 us per cycle for -O2 compile option */
    /* 1 us = ca. 16 cycles (80 MHz) / 1 us = 32 cycles (160 MHz) */

    if (cycles) {
        __asm__ volatile ("1: _addi.n  %0, %0, -1 \n"
                          "   bnez     %0, 1b     \n" : "=r" (cycles) : "0" (cycles));
    }
}

/* transfer related interrupts handled by the driver */
static const uint32_t transfer_int_mask = I2C_TRANS_COMPLETE_INT_ENA
                                        | I2C_END_DETECT_INT_ENA
                                        | I2C_ACK_ERR_INT_ENA
                                        | I2C_ARBITRATION_LOST_INT_ENA
                                        | I2C_TIME_OUT_INT_ENA;

/* at I2C_SPEED_NORMAL a transfer takes at most 33 byte * 9 clock cycles * 1/100000 s */
#define I2C_TRANSFER_TIMEOUT    3000

#define I2C_THREAD_FLAG BIT     (0)

#include "xtimer.h"

void _i2c_transfer_timeout (void *arg)
{
    i2c_t dev = (i2c_t)arg;

    /* reset the hardware if it I2C got stucked */
    _i2c_reset_hw(dev);

    /* set result to timeout */
    _i2c_bus[dev].results |= I2C_TIME_OUT_INT_ST;

    /* wake up the thread that is waiting for the results */
    thread_flags_set((thread_t*)thread_get(_i2c_bus[dev].pid), I2C_THREAD_FLAG);
}

/* Transfer of commands in I2C controller command pipeline */
static void _i2c_transfer (i2c_t dev)
{
    DEBUG("%s cmd=%d\n", __func__, _i2c_bus[dev].cmd);

    #if FIFO_USED
    /* reset RX FIFO queue */
    _i2c_hw[dev].regs->fifo_conf.rx_fifo_rst = 1;
    _i2c_hw[dev].regs->fifo_conf.rx_fifo_rst = 0;
    #endif

    /* disable and enable all transmission interrupts and clear current status */
    _i2c_hw[dev].regs->int_ena.val &= ~transfer_int_mask;
    _i2c_hw[dev].regs->int_ena.val |= transfer_int_mask;
    _i2c_hw[dev].regs->int_clr.val  = transfer_int_mask;

    /* set a timer for the case the I2C hardware gets stuck */
    xtimer_t i2c_timeout = {};
    i2c_timeout.callback = _i2c_transfer_timeout;
    i2c_timeout.arg = (void*)dev;
    xtimer_set(&i2c_timeout, I2C_TRANSFER_TIMEOUT);

    /* start execution of commands in command pipeline registers */
    _i2c_bus[dev].pid = thread_getpid();
    _i2c_bus[dev].results = 0;
    _i2c_hw[dev].regs->ctr.trans_start = 0;
    _i2c_hw[dev].regs->ctr.trans_start = 1;

    /* wait for transfer results and remove timeout timer*/
    thread_flags_wait_one(I2C_THREAD_FLAG);
    xtimer_remove(&i2c_timeout);

    /* returned from transmission */
    DEBUG("%s results=%08x\n", __func__, _i2c_bus[dev].results);

    #if FIFO_USED
    /* reset TX FIFO queue */
    _i2c_hw[dev].regs->fifo_conf.tx_fifo_rst = 1;
    _i2c_hw[dev].regs->fifo_conf.tx_fifo_rst = 0;
    #endif

    /* reset command and data index */
    _i2c_bus[dev].cmd = 0;
    _i2c_bus[dev].data = 0;
}

static void IRAM_ATTR _i2c_intr_handler (void *arg)
{
    /* to satisfy the compiler */
    (void)arg;

    irq_isr_enter ();

    /* all I2C peripheral interrupt sources are routed to the same interrupt,
       so we have to use the status register to distinguish interruptees */
    for (unsigned dev = 0; dev < i2c_bus_num; dev++) {
        /* test for transfer related interrupts */
        if (_i2c_hw[dev].regs->int_status.val & transfer_int_mask) {
            /* set transfer result */
            _i2c_bus[dev].results |= _i2c_hw[dev].regs->int_status.val;
            /* disable all interrupts and clear them and left them disabled */
            _i2c_hw[dev].regs->int_ena.val &= ~transfer_int_mask;
            _i2c_hw[dev].regs->int_clr.val  = transfer_int_mask;
            /* wake up the thread that is waiting for the results */
            thread_flags_set((thread_t*)thread_get(_i2c_bus[dev].pid), I2C_THREAD_FLAG);
        }
        else if (_i2c_hw[dev].regs->int_status.val) {
            /* if there are any other interrupts, clear them */
            _i2c_hw[dev].regs->int_clr.val = ~0x0U;
        }
    }

    irq_isr_exit ();
}

#if 1 /* TODO */
/* Some slave devices will die by accident and keep the SDA in low level,
 * in this case, master should send several clock to make the slave release
 * the bus.
 */
static void _i2c_clear_bus(i2c_t dev)
{
    /* reset the usage type in GPIO table */
    gpio_set_pin_usage(_i2c_hw[dev].pin_scl, _GPIO);
    gpio_set_pin_usage(_i2c_hw[dev].pin_sda, _GPIO);

    /* configure SDA and SCL pin as GPIO in open-drain mode temporarily */
    gpio_init (_i2c_hw[dev].pin_scl, GPIO_IN_OD_PU);
    gpio_init (_i2c_hw[dev].pin_sda, GPIO_IN_OD_PU);

    /* master send some clock pulses to make the slave release the bus */
    gpio_set (_i2c_hw[dev].pin_scl);
    gpio_set (_i2c_hw[dev].pin_sda);
    gpio_clear (_i2c_hw[dev].pin_sda);
    for (int i = 0; i < 20; i++) {
        gpio_toggle(_i2c_hw[dev].pin_scl);
    }
    gpio_set(_i2c_hw[dev].pin_sda);

    /* store the usage type in GPIO table */
    gpio_set_pin_usage(_i2c_hw[dev].pin_scl, _I2C);
    gpio_set_pin_usage(_i2c_hw[dev].pin_sda, _I2C);

    /* connect SCL and SDA pins to output signals through the GPIO matrix */
    GPIO.func_out_sel_cfg[_i2c_hw[dev].pin_scl].func_sel = _i2c_hw[dev].signal_scl_out;
    GPIO.func_out_sel_cfg[_i2c_hw[dev].pin_sda].func_sel = _i2c_hw[dev].signal_sda_out;

    /* connect SCL and SDA input signals to pins through the GPIO matrix */
    GPIO.func_in_sel_cfg[_i2c_hw[dev].signal_scl_in].sig_in_sel = 1;
    GPIO.func_in_sel_cfg[_i2c_hw[dev].signal_scl_in].sig_in_inv = 0;
    GPIO.func_in_sel_cfg[_i2c_hw[dev].signal_scl_in].func_sel = _i2c_hw[dev].pin_scl;
    GPIO.func_in_sel_cfg[_i2c_hw[dev].signal_sda_in].sig_in_sel = 1;
    GPIO.func_in_sel_cfg[_i2c_hw[dev].signal_sda_in].sig_in_inv = 0;
    GPIO.func_in_sel_cfg[_i2c_hw[dev].signal_sda_in].func_sel = _i2c_hw[dev].pin_sda;

    return;
}
#endif

/*
 * PLEASE NOTE: Following function is from the ESP-IDF and is licensed
 * under the Apache License, Version 2.0 (the "License").
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
 */
static void _i2c_reset_hw (i2c_t dev)
{
    /* save current configuration */
    uint32_t ctr              = _i2c_hw[dev].regs->ctr.val;
    uint32_t fifo_conf        = _i2c_hw[dev].regs->fifo_conf.val;
    uint32_t scl_low_period   = _i2c_hw[dev].regs->scl_low_period.val;
    uint32_t scl_high_period  = _i2c_hw[dev].regs->scl_high_period.val;
    uint32_t scl_start_hold   = _i2c_hw[dev].regs->scl_start_hold.val;
    uint32_t scl_rstart_setup = _i2c_hw[dev].regs->scl_rstart_setup.val;
    uint32_t scl_stop_hold    = _i2c_hw[dev].regs->scl_stop_hold.val;
    uint32_t scl_stop_setup   = _i2c_hw[dev].regs->scl_stop_setup.val;
    uint32_t sda_hold         = _i2c_hw[dev].regs->sda_hold.val;
    uint32_t sda_sample       = _i2c_hw[dev].regs->sda_sample.val;
    uint32_t timeout          = _i2c_hw[dev].regs->timeout.val;
    uint32_t scl_filter_cfg   = _i2c_hw[dev].regs->scl_filter_cfg.val;
    uint32_t sda_filter_cfg   = _i2c_hw[dev].regs->sda_filter_cfg.val;

    /* reset hardware mpdule */
    periph_module_disable(_i2c_hw[dev].mod);
    _i2c_clear_bus(dev);
    periph_module_enable(_i2c_hw[dev].mod);

    /* restore configuration */
    _i2c_hw[dev].regs->int_ena.val          = 0;
    _i2c_hw[dev].regs->ctr.val              = ctr & (~I2C_TRANS_START_M);
    _i2c_hw[dev].regs->fifo_conf.val        = fifo_conf;
    _i2c_hw[dev].regs->scl_low_period.val   = scl_low_period;
    _i2c_hw[dev].regs->scl_high_period.val  = scl_high_period;
    _i2c_hw[dev].regs->scl_start_hold.val   = scl_start_hold;
    _i2c_hw[dev].regs->scl_rstart_setup.val = scl_rstart_setup;
    _i2c_hw[dev].regs->scl_stop_hold.val    = scl_stop_hold;
    _i2c_hw[dev].regs->scl_stop_setup.val   = scl_stop_setup;
    _i2c_hw[dev].regs->sda_hold.val         = sda_hold;
    _i2c_hw[dev].regs->sda_sample.val       = sda_sample;
    _i2c_hw[dev].regs->timeout.val          = timeout;
    _i2c_hw[dev].regs->scl_filter_cfg.val   = scl_filter_cfg;
    _i2c_hw[dev].regs->sda_filter_cfg.val   = sda_filter_cfg;

    /* disable and clear all interrupt sources */
    _i2c_hw[dev].regs->int_ena.val = 0;
    _i2c_hw[dev].regs->int_clr.val = ~0x0U;

    return;
}

void i2c_print_config(void)
{
    for (unsigned bus = 0; bus < i2c_bus_num; bus++) {
        ets_printf("\tI2C_DEV(%d)\tscl=%d sda=%d\n",
                   bus, _i2c_hw[bus].pin_scl, _i2c_hw[bus].pin_sda);
    }
}

#else /* defined(I2C0_SPEED) || defined(I2C1_SPEED) */

void i2c_print_config(void)
{
    LOG_TAG_INFO("i2c", "no I2C devices\n");
}

#endif /* defined(I2C0_SPEED) || defined(I2C1_SPEED) */

#endif /* MODULE_ESP_I2C_HW */
